In [1]:
people = {
    "first" : ['Ram', 'Jon', 'Don'],
    "last" : ['Roy', 'Roy', 'Pal'],
    "email" : ['ramroy1@gamil.com', 'jonmaity2@gamil.com', 'donpal5@gamil.com'],
}

In [2]:
people['email']

['ramroy1@gamil.com', 'jonmaity2@gamil.com', 'donpal5@gamil.com']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

  first last                email
0   Ram  Roy    ramroy1@gamil.com
1   Jon  Roy  jonmaity2@gamil.com
2   Don  Pal    donpal5@gamil.com

In [6]:
df['email']

0      ramroy1@gamil.com
1    jonmaity2@gamil.com
2      donpal5@gamil.com
Name: email, dtype: object

In [7]:
type(df['email'])

pandas.core.series.Series

In [8]:
df[['last','first']]

  last first
0  Roy   Ram
1  Roy   Jon
2  Pal   Don

In [9]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [10]:
df.iloc[[0,1]]

  first last                email
0   Ram  Roy    ramroy1@gamil.com
1   Jon  Roy  jonmaity2@gamil.com

In [11]:
df.loc[[0]]

  first last              email
0   Ram  Roy  ramroy1@gamil.com

In [12]:
df.loc[0]

first                  Ram
last                   Roy
email    ramroy1@gamil.com
Name: 0, dtype: object

In [13]:
df.loc[[0,1],['email']]

                 email
0    ramroy1@gamil.com
1  jonmaity2@gamil.com

In [14]:
df.loc[[0,1],['email']]

                 email
0    ramroy1@gamil.com
1  jonmaity2@gamil.com

In [15]:
df.set_index('email')

                    first last
email
ramroy1@gamil.com     Ram  Roy
jonmaity2@gamil.com   Jon  Roy
donpal5@gamil.com     Don  Pal

In [16]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
df['last'] == 'Roy'

0     True
1     True
2    False
Name: last, dtype: bool

In [18]:
filt = (df['last'] == 'Roy')

In [19]:
df[filt]

  first last                email
0   Ram  Roy    ramroy1@gamil.com
1   Jon  Roy  jonmaity2@gamil.com

In [20]:
df.loc[filt]

  first last                email
0   Ram  Roy    ramroy1@gamil.com
1   Jon  Roy  jonmaity2@gamil.com

In [21]:
df.loc[filt, 'email']

0      ramroy1@gamil.com
1    jonmaity2@gamil.com
Name: email, dtype: object

In [22]:
df

  first last                email
0   Ram  Roy    ramroy1@gamil.com
1   Jon  Roy  jonmaity2@gamil.com
2   Don  Pal    donpal5@gamil.com

In [23]:
filt = (df['last'] == 'Roy') & (df['first'] == 'Ram')

In [24]:
df.loc[filt, 'email']

0    ramroy1@gamil.com
Name: email, dtype: object

In [25]:
filt = (df['last'] == 'Roy') | (df['first'] == 'Ram')

In [26]:
df.loc[filt, ['email']]

                 email
0    ramroy1@gamil.com
1  jonmaity2@gamil.com

In [27]:
df.loc[~filt, 'email']

2    donpal5@gamil.com
Name: email, dtype: object

In [28]:
df

  first last                email
0   Ram  Roy    ramroy1@gamil.com
1   Jon  Roy  jonmaity2@gamil.com
2   Don  Pal    donpal5@gamil.com

In [29]:
df.columns = ['first_name', 'last_name', 'email']

In [30]:
df

  first_name last_name                email
0        Ram       Roy    ramroy1@gamil.com
1        Jon       Roy  jonmaity2@gamil.com
2        Don       Pal    donpal5@gamil.com

In [31]:
df.columns = [x.upper() for x in df.columns]

In [32]:
df

  FIRST_NAME LAST_NAME                EMAIL
0        Ram       Roy    ramroy1@gamil.com
1        Jon       Roy  jonmaity2@gamil.com
2        Don       Pal    donpal5@gamil.com

In [33]:
df.columns = df.columns.str.replace('_', ' ')

In [34]:
df

  FIRST NAME LAST NAME                EMAIL
0        Ram       Roy    ramroy1@gamil.com
1        Jon       Roy  jonmaity2@gamil.com
2        Don       Pal    donpal5@gamil.com

In [35]:
df.columns = [x.lower() for x in df.columns]

In [36]:
df.columns = df.columns.str.replace(' ', '_')
df

  first_name last_name                email
0        Ram       Roy    ramroy1@gamil.com
1        Jon       Roy  jonmaity2@gamil.com
2        Don       Pal    donpal5@gamil.com

In [37]:
df.rename(columns = {'first_name': 'first', 'last_name': 'last'}, inplace =True)

In [38]:
df

  first last                email
0   Ram  Roy    ramroy1@gamil.com
1   Jon  Roy  jonmaity2@gamil.com
2   Don  Pal    donpal5@gamil.com

In [39]:
df

  first last                email
0   Ram  Roy    ramroy1@gamil.com
1   Jon  Roy  jonmaity2@gamil.com
2   Don  Pal    donpal5@gamil.com

In [40]:
 df.loc[2]

first                  Don
last                   Pal
email    donpal5@gamil.com
Name: 2, dtype: object

In [41]:
df.loc[2] = ['John', 'Smith', 'john12@gmail.com']

In [42]:
df

  first   last                email
0   Ram    Roy    ramroy1@gamil.com
1   Jon    Roy  jonmaity2@gamil.com
2  John  Smith     john12@gmail.com

In [43]:
df.loc[2,['last', 'email']]= ['Doe', 'namit15@gamil.com']

In [44]:
df

  first last                email
0   Ram  Roy    ramroy1@gamil.com
1   Jon  Roy  jonmaity2@gamil.com
2  John  Doe    namit15@gamil.com

In [45]:
df.loc[2,'last']= 'Smith'

In [46]:
df

  first   last                email
0   Ram    Roy    ramroy1@gamil.com
1   Jon    Roy  jonmaity2@gamil.com
2  John  Smith    namit15@gamil.com

In [47]:
filt= (df['email']== 'jonmaity2@gamil.com')

In [48]:
df[filt]['last']

1    Roy
Name: last, dtype: object

In [49]:
df[filt]['last'] = 'Smith'

C:\Users\Hp\AppData\Local\Temp\ipykernel_9196\662645475.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [50]:
df.loc[filt, 'last'] = 'Smith'

In [51]:
df

  first   last                email
0   Ram    Roy    ramroy1@gamil.com
1   Jon  Smith  jonmaity2@gamil.com
2  John  Smith    namit15@gamil.com

In [52]:
df['email'].str.lower()

0      ramroy1@gamil.com
1    jonmaity2@gamil.com
2      namit15@gamil.com
Name: email, dtype: object

In [53]:
df['email']= df['email'].str.lower()

In [54]:
df

  first   last                email
0   Ram    Roy    ramroy1@gamil.com
1   Jon  Smith  jonmaity2@gamil.com
2  John  Smith    namit15@gamil.com

In [55]:
df['email'].apply(len)

0    17
1    19
2    17
Name: email, dtype: int64

In [56]:
def update_email(email):
    return email.upper()
df['email'].apply(update_email)

0      RAMROY1@GAMIL.COM
1    JONMAITY2@GAMIL.COM
2      NAMIT15@GAMIL.COM
Name: email, dtype: object

In [57]:
df['email']= df['email'].apply(update_email)

In [58]:
df

  first   last                email
0   Ram    Roy    RAMROY1@GAMIL.COM
1   Jon  Smith  JONMAITY2@GAMIL.COM
2  John  Smith    NAMIT15@GAMIL.COM

In [59]:
df

  first   last                email
0   Ram    Roy    RAMROY1@GAMIL.COM
1   Jon  Smith  JONMAITY2@GAMIL.COM
2  John  Smith    NAMIT15@GAMIL.COM

In [60]:
df['email'].apply(len)

0    17
1    19
2    17
Name: email, dtype: int64

In [61]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [62]:
df.apply(len, axis= 'columns')

0    3
1    3
2    3
dtype: int64

In [63]:
len(df['email'])

3